//<< Портал-Юг, Свинцов И.И., 2019.02.13 [Общие метаданные] 
// Общий серверный модуль для размещения подписок на события 
//>> Портал-Юг, Свинцов И.И. 2019.02.13

#Область ПрограммныйИнтерфейс
// << MRS #ERP-5011 ДенисламовАД <Adel.Denislamov@mriyaresort.com> 25.04.25, ()
Процедура MRS_ДокументыСписанияЗаказаПовараОбработкаПроведения(Источник, Отказ, Замещение) Экспорт
	
	Если НЕ Отказ Тогда
		Попытка
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Товары.Номенклатура КАК Номенклатура,
			|	Товары.Характеристика КАК Характеристика,
			|	Товары.Количество КАК Количество,
			|	Товары.MRS_ЗаказПовара КАК MRS_ЗаказПовара,
			|	Товары.Склад КАК Склад
			|ИЗ
			|	Документ.ЗаказКлиента.Товары КАК Товары
			|ГДЕ
			|	НЕ Товары.MRS_ЗаказПовара = &MRS_ЗаказПовара
			|	И Товары.Ссылка = &Ссылка";
			
			Если ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗаказКлиента", "РеализацияТоваровУслуг");
			ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗаказКлиента", "ПеремещениеТоваров");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "Товары.Склад", "Товары.Ссылка.СкладПолучатель"); 
			КонецЕсли;
			Запрос.УстановитьПараметр("MRS_ЗаказПовара", Документы.MRS_ЗаказПовара.ПустаяСсылка());
			Запрос.УстановитьПараметр("Ссылка",Источник.Ссылка);
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			Если Выборка.Количество() Тогда
				// регистр MRS_ЗаказыПовара Приход
				Источник.Движения.MRS_ЗаказыПовара.Записывать = Истина;
				Пока Выборка.Следующий() Цикл
					Движение = Источник.Движения.MRS_ЗаказыПовара.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Источник.Дата;
					Движение.ЗаказПовара = Выборка.MRS_ЗаказПовара;
					Движение.Номенклатура = Выборка.Номенклатура;
					Движение.Характеристика = Выборка.Характеристика;
					Движение.Склад = Выборка.Склад;
					Движение.Заказано = Выборка.Количество;
				КонецЦикла;
			КонецЕсли;
		Исключение
			
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры
// >> MRS #ERP-5011 ДенисламовАД <Adel.Denislamov@mriyaresort.com> 25.04.25, ()

//<< Портал-Юг, Свинцов И.И., 2019.02.13 [5.2.27 Закрытие заказов по алкогольной продукции] 
Процедура ПЛ_РегистрыНакопленияПередЗаписьюПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КЧ = Новый КвалификаторыЧисла(12,0);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ.Колонки.Добавить("НомерЗаписи", ОписаниеТиповЧ);
	ТЗ.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	
	АлкогольнаяПродукцияВоВскрытойТаре = Ложь;	
	ИмяПоля = "";
	ТипДокумента = "";
	ВидДвижения = ""; 
	ОбнулитьКОтгрузке = Ложь;
	УдалитьЗаписиСвободныхОстатков = Ложь;
	ДобавитьЗаписиТоварыКОтгрузке = Ложь;
	
	ТипИсточника = ТипЗнч(Источник);
	ТипРегистратора = ТипЗнч(Источник.Отбор.Регистратор.Значение);
	
	Если ТипИсточника = Тип("РегистрНакопленияНаборЗаписей.ТоварыКОтгрузке") Тогда
		Если ТипРегистратора = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
			АлкогольнаяПродукцияВоВскрытойТаре = Истина;
			ИмяПоля = "ДокументОтгрузки";
			ТипДокумента = "ДокументСсылка.ЗаказНаПеремещение";
			ВидДвижения = ВидДвиженияНакопления.Приход;
			ОбнулитьКОтгрузке = Истина;
		ИначеЕсли  ТипРегистратора = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			ДобавитьЗаписиТоварыКОтгрузке = Истина;
			ИмяПоля = "ДокументОтгрузки";
			ТипДокумента = "ДокументСсылка.ЗаказНаПеремещение";
			ВидДвижения = ВидДвиженияНакопления.Расход;	
		Иначе
			Возврат;
		КонецЕсли;	
		
	ИначеЕсли ТипИсточника = Тип("РегистрНакопленияНаборЗаписей.ЗаказыНаПеремещение") Тогда
		Если ТипРегистратора = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			ИмяПоля = "ЗаказНаПеремещение";
			ТипДокумента = "ДокументСсылка.ЗаказНаПеремещение";
			//<< Портал-Юг, Баринов, 2019.09.20 [5.2.27 Закрытие заказов по алкогольной продукции]
			// Приходные движения в этом случае тоже нужно обработать - это строки сверх заказа с ресурсом "К оформлению".
			// ВидДвижения = ВидДвиженияНакопления.Расход;	
			//>> Портал-Юг, Баринов, 2019.09.20
		Иначе
			Возврат;
		КонецЕсли;	
		
	ИначеЕсли ТипИсточника = Тип("РегистрНакопленияНаборЗаписей.ЗаказыПоставщикам") Тогда
		Если ТипРегистратора = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			ИмяПоля = "ЗаказПоставщику";
			ТипДокумента = "ДокументСсылка.ЗаказПоставщику";
			ВидДвижения = ВидДвиженияНакопления.Приход; 
		ИначеЕсли ТипРегистратора = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
			ИмяПоля = "ЗаказПоставщику";
			ТипДокумента = "ДокументСсылка.ЗаказПоставщику";
			//<< Портал-Юг, Баринов, 2019.09.20 [5.2.27 Закрытие заказов по алкогольной продукции]
			// Приходные движения в этом случае тоже нужно обработать - это строки сверх заказа с ресурсом "К оформлению".
			// ВидДвижения = ВидДвиженияНакопления.Расход;	
			//>> Портал-Юг, Баринов, 2019.09.20
		Иначе
			Возврат;
		КонецЕсли;	
		
	ИначеЕсли ТипИсточника = Тип("РегистрНакопленияНаборЗаписей.ТоварыКПоступлению") Тогда
		Если ТипРегистратора = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			ИмяПоля = "ДокументПоступления";
			ТипДокумента  = "ДокументСсылка.ЗаказНаПеремещение";
			ВидДвижения = "";
		ИначеЕсли ТипРегистратора = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			ИмяПоля = "ДокументПоступления";
			ТипДокумента  = "ДокументСсылка.ЗаказПоставщику";
			ВидДвижения = "";
		ИначеЕсли ТипРегистратора = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
			ИмяПоля = "ДокументПоступления";
			ТипДокумента = "ДокументСсылка.ЗаказПоставщику";
			ВидДвижения = ВидДвиженияНакопления.Расход;
		Иначе
			Возврат;
		КонецЕсли;
		
	Иначе
		Возврат;	
	КонецЕсли;
	
	СтрПараметров = Новый Структура;
	СтрПараметров.Вставить("Источник", Источник);
	СтрПараметров.Вставить("ИмяПоля", ИмяПоля);
	СтрПараметров.Вставить("ТипДокумента", ТипДокумента);
	СтрПараметров.Вставить("ВидДвижения", ВидДвижения);
	
	ДобавитьСтрокиВТЗ(ТЗ, СтрПараметров);
	
	Если ТЗ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	КоллекцияРесурсовРН = Источник.Метаданные().Ресурсы;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(НаборЗаписей.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	НаборЗаписей.НомерЗаписи КАК НомерЗаписи,
	|	ВЫРАЗИТЬ(НаборЗаписей.Склад КАК Справочник.Склады) КАК Склад
	|ПОМЕСТИТЬ ВТ_НаборЗаписей
	|ИЗ
	|	&НаборЗаписей КАК НаборЗаписей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НаборЗаписей.Номенклатура КАК Номенклатура,
	|	ВТ_НаборЗаписей.Номенклатура.ОбъемДАЛ КАК ОбъемДАЛ,
	|	ВТ_НаборЗаписей.Номенклатура.ПЛ_НоменклатураВоВскрытойТаре КАК НоменклатураВоВскрытойТаре,
	|	ВТ_НаборЗаписей.НомерЗаписи КАК НомерЗаписи,
	|	ВТ_НаборЗаписей.Склад КАК Склад,
	|	ВТ_НаборЗаписей.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке КАК СкладИспользоватьОрдернуюСхемуПриОтгрузке,
	|	ВТ_НаборЗаписей.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке КАК СкладДатаНачалаОрдернойСхемыПриОтгрузке,
	|	ВТ_НаборЗаписей.Номенклатура.Представление КАК НомПредставление
	|ИЗ
	|	ВТ_НаборЗаписей КАК ВТ_НаборЗаписей
	|ГДЕ
	|	ВТ_НаборЗаписей.Номенклатура.АлкогольнаяПродукция
	|	И ВТ_НаборЗаписей.Номенклатура.АлкогольнаяПродукцияВоВскрытойТаре = &АлкогольнаяПродукцияВоВскрытойТаре
	|	И НЕ ВТ_НаборЗаписей.Номенклатура.ПЛ_ИспользуетсяВЗаказах
	|	И ВТ_НаборЗаписей.Склад.ПЛ_ИспользоватьПодменуАлкогольнойПродукции";
	
	Запрос.УстановитьПараметр("АлкогольнаяПродукцияВоВскрытойТаре", АлкогольнаяПродукцияВоВскрытойТаре);
	Запрос.УстановитьПараметр("НаборЗаписей", ТЗ);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВДЗ = РезультатЗапроса.Выбрать();
	
	Пока ВДЗ.Следующий() Цикл
		
		Если ОбнулитьКОтгрузке Тогда
			Если ВДЗ.СкладИспользоватьОрдернуюСхемуПриОтгрузке И ВДЗ.СкладДатаНачалаОрдернойСхемыПриОтгрузке <= Источник.ДополнительныеСвойства.ДатаРегистратора Тогда
				Источник[ВДЗ.НомерЗаписи].КОтгрузке = 0;
			КонецЕсли;
		Иначе
			
			Если НЕ ЗначениеЗаполнено(ВДЗ.НоменклатураВоВскрытойТаре) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ВДЗ.ОбъемДАЛ = 0 Тогда
				
				ТекстСообщения = НСтр("ru='Не указан объем ДАЛ для %НомПредставление%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения,"%НомПредставление%", ВДЗ.НомПредставление);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ВДЗ.Номенклатура, , , Отказ);   
				
			Иначе
				
				Если Отказ Тогда
					Продолжить;
				КонецЕсли;
				
				// Добавляем записи для формирования потребности в расходных ордерах
				// Только для перемещений со склада с ордерной отгрузкой и флагом подмены алкогольной продукции
				Если ДобавитьЗаписиТоварыКОтгрузке Тогда
					
					Если ВДЗ.СкладИспользоватьОрдернуюСхемуПриОтгрузке И ВДЗ.СкладДатаНачалаОрдернойСхемыПриОтгрузке <= Источник.ДополнительныеСвойства.ДатаРегистратора Тогда
						НоваяЗапись = Источник.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяЗапись, Источник[ВДЗ.НомерЗаписи]);
						НоваяЗапись.Регистратор = Источник.Отбор.Регистратор;
						НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход; 
						НоваяЗапись.КОтгрузке = Источник[ВДЗ.НомерЗаписи].КОформлению;
						НоваяЗапись.КОформлению = 0;
					КонецЕсли;
					
				КонецЕсли;
				
				Источник[ВДЗ.НомерЗаписи].Номенклатура = ВДЗ.НоменклатураВоВскрытойТаре;
				
				Для каждого ИмяРесурса Из КоллекцияРесурсовРН Цикл
					Источник[ВДЗ.НомерЗаписи][ИмяРесурса.Имя] = Источник[ВДЗ.НомерЗаписи][ИмяРесурса.Имя] * ВДЗ.ОбъемДАЛ *10;
				КонецЦикла;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //>> Портал-Юг, Свинцов И.И. 2019.02.13

//<< Портал-Юг, Свинцов И.И., 2019.02.20 [5.2.27 Закрытие заказов по алкогольной продукции] 
Процедура ПЛ_ДокументыДляЗаказовАлкоголяОбработкаЗаполненияОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказПоставщику") Тогда
		
		//<< Портал-Юг, Баринов, 2019.09.20 [5.2.27 Закрытие заказов по алкогольной продукции]
		//Запрос.УстановитьПараметр("Товары", Источник.Товары.Выгрузить(, "Номенклатура, Склад"));
		Запрос.УстановитьПараметр("Товары", Источник.Товары.Выгрузить(Новый Структура("Отменено", Ложь), "Номенклатура, Склад"));
		//>> Портал-Юг, Баринов, 2019.09.20
				
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказНаПеремещение") Тогда
		
		Товары = Новый ТаблицаЗначений;
		Товары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); 
		Товары.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
		
		Для каждого СтрТаблицы Из Источник.Товары Цикл
			//<< Портал-Юг, Баринов, 2019.09.20 [5.2.27 Закрытие заказов по алкогольной продукции]
			Если СтрТаблицы.Отменено Тогда 
				Продолжить;	
			КонецЕсли;	
			//>> Портал-Юг, Баринов, 2019.09.20
			стрТовары = Товары.Добавить();
			стрТовары.Номенклатура = СтрТаблицы.Номенклатура; 
			стрТовары.Склад = Источник.СкладОтправитель;              
		КонецЦикла; 
		
		Запрос.УстановитьПараметр("Товары", Товары);
		
	Иначе
		Возврат;
	КонецЕсли;	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(Товары.Склад КАК Справочник.Склады) КАК Склад
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.Номенклатура.Представление КАК НомПредставление,
	|	ВТ_Товары.Склад.Представление КАК СкладПредставление
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|ГДЕ
	|	ВТ_Товары.Номенклатура.АлкогольнаяПродукция
	|	И НЕ ВТ_Товары.Номенклатура.ПЛ_ИспользуетсяВЗаказах
	|	И НЕ ВТ_Товары.Номенклатура.АлкогольнаяПродукцияВоВскрытойТаре
	|	И ВТ_Товары.Склад.ПЛ_ИспользоватьПодменуАлкогольнойПродукции"; 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВДЗ = РезультатЗапроса.Выбрать();
	Пока ВДЗ.Следующий() Цикл
		
		ТекстСообщения = НСтр("ru='Номенклатуру %НомПредставление% нельзя использовать на складе %СкладПредставление%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%НомПредставление%", ВДЗ.НомПредставление);
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%СкладПредставление%", ВДЗ.СкладПредставление);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ВДЗ.Номенклатура, , , Отказ);
		
	КонецЦикла;
	
КонецПроцедуры //>> Портал-Юг, Свинцов И.И., 2019.02.20

//<< Портал-Юг, Свинцов И.И., 2019.02.26 [5.2.29 Автоматическая генерация серий и заполнение документа «Приобретение товаров и услуг» по данны] 
Процедура ПЛ_ДокументПриобретениеТиУОбработкаЗаполненияОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	//<< Портал-Юг, Баринов, 2019.08.21 [Интерфейс]
	Источник.РегистрироватьЦеныПоставщика = Истина;
	Источник.ЦенаВключаетНДС = Истина;
	//>> Портал-Юг, Баринов, 2019.08.21
	
	ПЛ_Сервер.ЗаполнитьПриобретениеТоваровСериямиТТНВходящаяЕГАИС(Источник, ДанныеЗаполнения);
	
КонецПроцедуры //>> Портал-Юг, Свинцов И.И., 2019.02.26

//<< Портал-Юг, Баринов, 2019.03.18 [6.2.22 Загрузка продаж из Sanatorium]
// Обработчик события "ПриЗаписи" из подписки на событие ПЛ_ЧекОбщепитаПриЗаписи
//
// Параметры:
//  Источник - ДокументОбъект.питДанныеПродажФронта - записанный документ
//  Отказ	 - Булево - Стандартный параметр события "ПриЗаписи"
//
Процедура ПЛ_ЧекОбщепитаПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		// Процедура должна быть вызвана именно при загрузке чека для обновления записи о статусе обработки.
		РегистрыСведений.ПЛ_СтатусыОбработкиЧековОбщепита.ПриЗаписиЧека(Источник, Отказ);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //>> Портал-Юг, Баринов, 2019.03.18

// << Портал-Юг, Баринов, 2019.04.25 [5.3.3 Запрет на изменение проведённых документов]
// Обработчик события "ПриЗаписи" из подписки на событие ПЛ_ПеремещениеТоваровПриЗаписиОграничениеПоОтправителю
//
// Параметры:
//  Источник - ДокументОбъект.ПеремещениеТоваров - записанный документ
//  Отказ	 - Булево - Стандартный параметр события "ПриЗаписи"
//
Процедура ПЛ_ПеремещениеТоваровПриЗаписиОграничениеПоОтправителюПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	// Ограничение нужно только для проведения и изменения проведённых.
	// Пользователь может провести документ, но не может изменять проведённый. И проводить должен иметь возможность только при наличии доступа к складу отправителю.
	// Типовая даёт доступ к документу при наличии доступа к любому из складов документа.
	// Для типовой роли с отменой проведения доступ не ограничиваем.
	
	// Всегда стираем старую запись
	// Если действуют ограничения, у пользователя должно хватить прав на новую запись. Иначе она не нужна.
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.ПЛ_ПеремещениеПоСкладуОтправителю.СоздатьМенеджерЗаписи();
	Запись.Перемещение = Источник.Ссылка;
	Запись.Удалить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если НЕ Источник.Проведен Тогда
		// Важно только проведение документов.
		Возврат;
	КонецЕсли;	
	
	Если ПравоДоступа("ОтменаПроведения", Источник.Метаданные()) Тогда 
		// Если доступна отмена проведения, то ограничение по складу отправителю не действует, работает типовое ограничение доступа.
		Возврат;
	КонецЕсли;	
	
	// При отсутствии доступа к складу запись будет отменена с выдачей сообщения о нарушении прав доступа
	Запись = РегистрыСведений.ПЛ_ПеремещениеПоСкладуОтправителю.СоздатьМенеджерЗаписи();
	Запись.Перемещение = Источник.Ссылка;
	Запись.СкладОтправитель = Источник.СкладОтправитель;
	ПредставлениеСклада = Строка(Источник.СкладОтправитель); // в обработке исключения читать будет уже поздно
	
	Попытка
		Запись.Записать();
	Исключение		
		СообщениеОбОшибке = НСтр("ru = 'Недостаточно прав доступа для проведения документа по складу %1.'") + Символы.ПС + Источник;
		СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеОбОшибке, ПредставлениеСклада);
		ВызватьИсключение СообщениеОбОшибке;
	КонецПопытки;
	
КонецПроцедуры //>> Портал-Юг, Баринов, 2019.04.25

//<< Портал-Юг, Гладкая Н., 2020.05.28 [Обмен с Elma.Очищаем реквизиты ELMA]			    
Процедура ПЛ_ЗаказНаПеремещениеПриКопированииПриКопировании(Источник, ОбъектКопирования) Экспорт
	РеквизитыДокумента=Новый Структура;
	РеквизитыДокумента.Вставить("ПЛ_UidПотребностиELMA", Неопределено);
	РеквизитыДокумента.Вставить("ПЛ_СозданНаОснованииПотребностиELMA", Неопределено);
	РеквизитыДокумента.Вставить("ПЛ_ПринятоELMA", Неопределено);
	ЗаполнитьЗначенияСвойств(РеквизитыДокумента,Источник);
	Если  РеквизитыДокумента.ПЛ_СозданНаОснованииПотребностиELMA<>Неопределено Тогда
		Источник.ПЛ_СозданНаОснованииПотребностиELMA=Ложь;
	КонецЕсли;
	Если Источник.Товары.Количество()>0 Тогда
		ЗаполнитьЗначенияСвойств(РеквизитыДокумента,Источник.Товары[0]);
		Если  РеквизитыДокумента.ПЛ_ПринятоELMA<>Неопределено Тогда
			Для Каждого Ст Из  Источник.Товары Цикл
				Ст.ПЛ_ПринятоELMA=Ложь;
			КонецЦикла;
		КонецЕсли;
		Если  РеквизитыДокумента.ПЛ_UidПотребностиELMA<>Неопределено Тогда
			Для Каждого Ст Из  Источник.Товары Цикл
				Ст.ПЛ_UidПотребностиELMA="";
			КонецЦикла;
			
		КонецЕсли;

	КонецЕсли;
КонецПроцедуры

// >> Швецов. 03.04.26 Перенеcено из расширения
Процедура MRS_ОбработкаПроведенияПТиУ(Источник, Отказ) Экспорт
	
	// регистр КГМ_Прослеживаемость
	Движения = Источник.Движения;
	
	Движения.алкАкцизПоПриобретеннымЦенностям.Записывать = Истина;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПриобретениеТоваровУслуг") Тогда
				
		//Если СокрЛП(Год(Дата))="2 021" Тогда 
		//	Коэф=0.031;  
		//Иначе 
			Коэф = 0.032; 
		//КонецЕсли;
		
		Для Каждого ТекСтрокаТовары Из Источник.Товары Цикл   
			
			Если ТекСтрокаТовары.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Виноград") Тогда
			
				// Расход ====================================================================================================================
				Движение = Движения.алкАкцизПоПриобретеннымЦенностям.Добавить();  
				
				Движение.Активность		= Истина;
				Движение.Период			= Источник.Дата; 
				Движение.Организация	= Источник.Организация;  
				
				Если Источник.Договор.Пустая() = Истина Тогда
							
					Движение.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("Номер","1-Виноград"); 
				
				Иначе 
					
					Движение.ДоговорКонтрагента = Источник.Договор;  
				
			    КонецЕсли; 	 
			
			
				Движение.Сделка = Источник.ссылка;   
					
				// Измерения 
				Движение.СерияНоменклатуры	= ТекСтрокаТовары.Серия;    
				Движение.Номенклатура		= ТекСтрокаТовары.Номенклатура;

				Движение.СостояниеСырья		= Перечисления.алкСостоянияПодакцизногоСырья.ВМестахХранения;
				Движение.СтатусАкциза		= Перечисления.алкСостоянияОплатыВходящегоАкциза.АкцизПоОплаченнымМЦ;
				
				Движение.Количество			= ТекСтрокаТовары.Количество;
				//Движение.Стоимость		= 0;
				Движение.СуммаАкциза		= Коэф*ТекСтрокаТовары.Количество;  
				Движение.КБК				= Справочники.алкКодыБюджетнойКлассификации2005.НайтиПоКоду("18210302091011000110");
				Движение.СуммаПлатежа 		= ТекСтрокаТовары.СуммаСНДС;	
			
			
		    ИначеЕсли ТекСтрокаТовары.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Виноматериал") Тогда  
					
				Движение 					= Движения.алкАкцизПоПриобретеннымЦенностям.Добавить();  
				
				Движение.Активность			= Истина;
				Движение.Период				= Источник.Дата; 
				Движение.Организация		= Источник.Организация; 
				Движение.ДоговорКонтрагента = Источник.Договор;
				Движение.Сделка 			= Источник.ссылка;   
					
				// Измерения 
				Движение.СерияНоменклатуры	= ТекСтрокаТовары.Серия;    
				Движение.Номенклатура		= ТекСтрокаТовары.Номенклатура;

				Движение.СостояниеСырья		= Перечисления.алкСостоянияПодакцизногоСырья.ВМестахХранения;
				Движение.СтатусАкциза		= Перечисления.алкСостоянияОплатыВходящегоАкциза.АкцизПоОплаченнымМЦ;
				
				Движение.Количество			= ТекСтрокаТовары.Количество;
				//Движение.Стоимость		= 0;
				Движение.СуммаАкциза		= 32*ТекСтрокаТовары.Количество*10;  
				Движение.КБК				= Справочники.алкКодыБюджетнойКлассификации2005.НайтиПоКоду("18210302090011000110");
				Движение.СуммаПлатежа		= ТекСтрокаТовары.СуммаСНДС;	
			
			КонецЕсли;
			
			// Реквизиты
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда 
		
		Для Каждого ТекСтрокаТовары Из Источник.Товары Цикл
			
			Движения = Источник.Движения;
			// Расход ====================================================================================================================
			Движение = Движения.КГМ_Прослеживаемость.Добавить();
			
			Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;
			Движение.Период			= Источник.Дата;
			
			// Измерения 
			Движение.Номенклатура	= ТекСтрокаТовары.Номенклатура;
			Движение.Партия			= ТекСтрокаТовары.Серия;
			Движение.Склад			= ТекСтрокаТовары.Склад;
			Движение.Подразделение	= Источник.Подразделение;
			
			// Ресурсы
			Движение.Количество		= ТекСтрокаТовары.Количество;
			Движение.Стоимость		= 0;
			Движение.Акциз			= 0;
			
			// Реквизиты
			Движение.КорНоменклатура	= ТекСтрокаТовары.Номенклатура;
			Движение.КорПартия			= ТекСтрокаТовары.Серия;
			Движение.КорСклад			= ТекСтрокаТовары.Склад;
			Движение.КорПодразделение	= Источник.Подразделение;
			Движение.Контрагент			= Источник.Контрагент;
			Движение.СтоимостьОплачено	= 0;
			Движение.КоличествоДоп		= ТекСтрокаТовары.Количество;
			
			Движение.ТехнологическаяОперация		= Справочники.КГМ_ТехнологическиеОперацииВиноделия.РеализацияПокупателям;
			Движение.ВидОперацииДляПрослеживаемости	= Перечисления.ВидыОперацийДляПрослеживаемости.ПоставкаАПОпт;  
			Движение.ГУИДЗаписи = Новый УникальныйИдентификатор();
			
			
			// Приход ==========================================================================================================================
			Движение = Движения.КГМ_Прослеживаемость.Добавить();
			
			Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;
			Движение.Период			= Источник.Дата;
			
			// Измерения 
			Движение.Номенклатура	= ТекСтрокаТовары.Номенклатура;
			Движение.Партия			= ТекСтрокаТовары.Серия;
			Движение.Склад			= ТекСтрокаТовары.Склад;
			Движение.Подразделение	= Источник.Подразделение;
			
			// Ресурсы
			Движение.Количество		= ТекСтрокаТовары.Количество;
			Движение.Стоимость		= 0;
			Движение.Акциз			= ТекСтрокаТовары.алкСуммаАкцизаНачисленного;
			//	#Кондрат 30.09.2021 [>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
			Движение.КоличествоРеализации = ТекСтрокаТовары.Количество*ТекСтрокаТовары.Номенклатура.ОбъемДал*10; // в литрах!
			//	#Кондрат 30.09.2021 ]<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
			
			// Реквизиты
			Движение.КорНоменклатура	= ТекСтрокаТовары.Номенклатура;
			Движение.КорПартия			= ТекСтрокаТовары.Серия;
			Движение.КорСклад			= ТекСтрокаТовары.Склад;
			Движение.КорПодразделение	= Источник.Подразделение;
			Движение.Контрагент			= Источник.Контрагент;
			Движение.СтоимостьОплачено	= 0;
			Движение.КоличествоДоп		= ТекСтрокаТовары.Количество;
			
			Движение.ТехнологическаяОперация		= Справочники.КГМ_ТехнологическиеОперацииВиноделия.РеализацияПокупателям;		
			Движение.ВидОперацииДляПрослеживаемости	= Перечисления.ВидыОперацийДляПрослеживаемости.ПоставкаАПОпт;
			Движение.ГУИДЗаписи = Новый УникальныйИдентификатор();
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда	
		
		Для Каждого ТекСтрокаТовары Из Источник.Товары Цикл
			
			// Расход ====================================================================================================================
			Движение = Движения.КГМ_Прослеживаемость.Добавить();
			
			Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;
			Движение.Период			= Источник.Дата;
			
			// Измерения 
			Движение.Номенклатура	= ТекСтрокаТовары.Номенклатура;
			Движение.Партия			= ТекСтрокаТовары.Серия;
			Движение.Склад			= Источник.СкладОтправитель;
			Движение.Подразделение	= Источник.Подразделение;
			
			// Ресурсы
			Движение.Количество		= ТекСтрокаТовары.Количество;
			Движение.Стоимость		= 0;
			Движение.Акциз			= 0;
			
			// Реквизиты
			Движение.КорНоменклатура	= ТекСтрокаТовары.Номенклатура;
			Движение.КорПартия			= ТекСтрокаТовары.Серия;
			Движение.КорСклад			= Источник.СкладПолучатель;
			Движение.КорПодразделение	= Источник.Подразделение;
			//Движение.Контрагент			= Контрагент;
			Движение.СтоимостьОплачено	= 0;
			Движение.КоличествоДоп		= ТекСтрокаТовары.Количество;
			
			Движение.ТехнологическаяОперация		= Справочники.КГМ_ТехнологическиеОперацииВиноделия.ПеремещениеВРозницу;
			Движение.ВидОперацииДляПрослеживаемости	= Перечисления.ВидыОперацийДляПрослеживаемости.ПоставкаАПРознице;  
			Движение.ГУИДЗаписи = Новый УникальныйИдентификатор();
			
			
			// Приход ==========================================================================================================================
			Движение = Движения.КГМ_Прослеживаемость.Добавить();
			
			Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;
			Движение.Период			= Источник.Дата;
			
			// Измерения 
			Движение.Номенклатура	= ТекСтрокаТовары.Номенклатура;
			Движение.Партия			= ТекСтрокаТовары.Серия;
			Движение.Склад			= Источник.СкладПолучатель;
			Движение.Подразделение	= Источник.Подразделение;
			
			// Ресурсы
			Движение.Количество		= ТекСтрокаТовары.Количество;
			Движение.Стоимость		= 0;
			Движение.Акциз			= ТекСтрокаТовары.алкСуммаАкцизаНачисленного;
			//	#Кондрат 30.09.2021 [>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
			Движение.КоличествоРеализации = ТекСтрокаТовары.Количество*ТекСтрокаТовары.Номенклатура.ОбъемДал*10; // в литрах!
			//	#Кондрат 30.09.2021 ]<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<
			
			
			// Реквизиты
			Движение.КорНоменклатура	= ТекСтрокаТовары.Номенклатура;
			Движение.КорПартия			= ТекСтрокаТовары.Серия;
			Движение.КорСклад			= Источник.СкладОтправитель;
			Движение.КорПодразделение	= Источник.Подразделение;
			//Движение.Контрагент			= Контрагент;
			Движение.СтоимостьОплачено	= 0;
			Движение.КоличествоДоп		= ТекСтрокаТовары.Количество;
			
			Движение.ТехнологическаяОперация		= Справочники.КГМ_ТехнологическиеОперацииВиноделия.ПеремещениеВРозницу;		
			Движение.ВидОперацииДляПрослеживаемости	= Перечисления.ВидыОперацийДляПрослеживаемости.ПоставкаАПРознице;
			Движение.ГУИДЗаписи = Новый УникальныйИдентификатор();
		КонецЦикла;
		
	Иначе
		// другие документы не добавлены в Источники подписки
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//<< Портал-Юг, Свинцов И.И., 2019.02.18 [5.2.27 Закрытие заказов по алкогольной продукции]
Процедура ДобавитьСтрокиВТЗ(ТЗ, СтрПараметров)
	
	НомерЗаписи = -1;
	
	Если СтрПараметров.Источник.Метаданные().Реквизиты.Найти("Склад") <> Неопределено Тогда
		Склад = Справочники.Склады.ПустаяСсылка();
	ИначеЕсли СтрПараметров.Источник.Отбор.Регистратор.Значение.Метаданные().Реквизиты.Найти("Склад") <> Неопределено Тогда 
		Склад = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрПараметров.Источник.Отбор.Регистратор.Значение, "Склад");
	ИначеЕсли СтрПараметров.Источник.Отбор.Регистратор.Значение.Метаданные().Реквизиты.Найти("СкладОтправитель") <> Неопределено Тогда
		Склад = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрПараметров.Источник.Отбор.Регистратор.Значение, "СкладОтправитель");
	Иначе
		Возврат;
	КонецЕсли;
	
	Для каждого Запись Из СтрПараметров.Источник Цикл
		
		НомерЗаписи = НомерЗаписи + 1;
		Если ЗначениеЗаполнено(СтрПараметров.ВидДвижения) Тогда
			Если Запись.ВидДвижения <> СтрПараметров.ВидДвижения Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(СтрПараметров.ИмяПоля) Тогда
			Если ТипЗнч(Запись[СтрПараметров.ИмяПоля]) <>  Тип(СтрПараметров.ТипДокумента) Тогда
				Продолжить;	
			КонецЕсли;	
		КонецЕсли;
		
		СтрокаТЗ = ТЗ.Добавить();
		СтрокаТЗ.Номенклатура = Запись.Номенклатура;
		СтрокаТЗ.НомерЗаписи =  НомерЗаписи;
		СтрокаТЗ.Склад =  ?(ЗначениеЗаполнено(Склад), Склад, Запись.Склад);
		
	КонецЦикла; 
	
КонецПроцедуры //>> Портал-Юг, Свинцов И.И., 2019.02.18

Процедура ОбработкаПроведения_ЗаказПоставщику(Источник, Отказ, РежимПроведения)
	
	Если Источник.Статус = Перечисления.СтатусыЗаказовПоставщикам.Согласован Тогда
		
		ДвиженияЗаказыПоставщикам=Источник.Движения.ЗаказыПоставщикам;
	 	ДвиженияЗаказыПоставщикам.Прочитать();

		ТЗДвиженияЗаказыПоставщикам = Новый ТаблицаЗначений;
		ТЗДвиженияЗаказыПоставщикам = ДвиженияЗаказыПоставщикам.Выгрузить();
	
		Источник.ОбменДанными.Загрузка = Истина;
		ДвиженияЗаказыПоставщикам.ОбменДанными.Загрузка = Истина;
		Для каждого стр Из ТзДвиженияЗаказыПоставщикам Цикл
		    стр.КОформлению = стр.Заказано;
		КонецЦикла; 
		ДвиженияЗаказыПоставщикам.Загрузить(ТЗДвиженияЗаказыПоставщикам);
		ДвиженияЗаказыПоставщикам.Записать(Истина);
	КонецЕсли; 
	
КонецПроцедуры	
//<< ПорталЮг, КондрашихинИА, 11.11.2024 [Автоматическое закрытие заказов поставщику и заказов на перемещение]
//
Процедура докЗаказыОбновитьОчередьЗаказовКЗакрытиюПриЗаписи(Источник, Отказ, РежимПроведения) Экспорт
	
	ЗаписьНеТребуется = Источник.ОбменДанными.Загрузка 
	ИЛИ Отказ
	ИЛИ Источник = Неопределено
	ИЛИ НЕ Источник.ДополнительныеСвойства.ПроведениеДокументов.СвойстваДокумента.РежимЗаписи = РежимЗаписиДокумента.Проведение
	ИЛИ Источник.ДополнительныеСвойства.Свойство("ПЛ_РегламентноеЗаданиеЗакрытиеЗаказов"); 
	
	Если ЗаписьНеТребуется Тогда  
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.ПЛ_ОчередьЗаказовКЗакрытию.ДобавитьЗаказВОчередь(Источник.Ссылка);

КонецПроцедуры

Процедура приобретениеТоваровУслугПоставитьСтатусЗаказаПоставщикуЕЛМАВОчередьПриЗаписи(Источник, Отказ) Экспорт

	Если Источник = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если НЕ Источник.Проведен Тогда
		Возврат;
	КонецЕсли;

	Если НЕ Источник.ПоступлениеПоЗаказам Тогда
		Возврат;
	КонецЕсли;

	Попытка

		MRS_ИнтеграцияЕЛМАСервер.ПоставитьПриобретениеВОчередьСтатусаЗаказаПоставщикуЕЛМА(Источник);

	Исключение

		ОписаниеОшибкиЕЛМА = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибкиЕЛМА = СтрШаблон(
			"Ошибка постановки ПТУ в очередь отправки статуса заказа поставщику в ЕЛМА при записи документа: %1",
			ОписаниеОшибкиЕЛМА);
		ЗаписьЖурналаРегистрации("MRS.ЕЛМА", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибкиЕЛМА);

	КонецПопытки;

КонецПроцедуры

#КонецОбласти
